
* Глобальные сочетания клавиш

#+NAME: key-bindings-table
| Сочетание | Функция             |
|-----------+---------------------|
| C--       | text-scale-decrease |
| C-+       | text-scale-increase |
| C-=       | text-scale-increase |
| C-M-=     | text-scale-set      |

#+BEGIN_SRC emacs-lisp :var table=key-bindings-table
(-map
 (lambda (row)
   (cl-destructuring-bind (соч фун) row
     (global-set-key (kbd соч) (intern фун))))
 table)
#+END_SRC

#+RESULTS:
| text-scale-decrease | text-scale-increase | text-scale-increase | text-scale-set |

